alphabet= {'а':'.-', 'б':'-...', 'в':'.--', 'г':'--.', 'д':'-..', 'е':'.', 'ж':'...-',
           'з':'--..', 'и':'..', 'й':'.---', 'к':'-.-', 'л':'.-..', 'м':'--', 'н':'-.',
           'о':'---', 'п':'.--.', 'р':'.-.', 'с':'...', 'т':'-', 'у':'..-', 'ф':'..-.',
           'х':'....', 'ц':'-.-.', 'ч':'---.', 'ш':'----', 'щ':'--.-', 'ъ':'.--.-.',
           'ы':'-.--', 'ь':'-..-', 'э':'...-...', 'ю':'..--', 'я':'.-.-', ',':'.-.-.-',
           '.':'......', '?':'..--..', '!':'--..--'}
def main():
    print('Это дешифратор из русского в Морзе и обратно, выберите действие, написав 1 или 2.')
    print('Русский в морзе: 1')
    print('Морзе в русский: 2')
    a= int(input('Вы выбираете: '))
    if a== 1:
        shifrovka()
    else:
        deshifrovka()
def shifrovka():
    predl= input("Введите предложение, которое хотите перевести без скобок, цифр и пробелов: ")
    sent= list(predl)
    for i in range(0, len(sent)):
        sent[i]= sent[i].lower()
        sent[i]= alphabet[sent[i]]
    print('Вот ваше предложение в азбуке Морзе: ', *sent)
    main()
def deshifrovka():
    itog= ''
    sent= input("Введите предложение, которое хотите перевести без скобок, цифр, каждую букву через пробел: ").split(' ')
    for i in range(0, len(sent)):
        for k in alphabet.keys():
            if alphabet[k]==sent[i]:
                itog+= k
    print(itog)
    main()
main()
    
